Revit 2024 API
LabelUtils.GetLabelForBuiltInParameter Method (ForgeTypeId, LanguageType)
 Gets the user-visible name for a built-in parameter in a specific LanguageType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public static string GetLabelForBuiltInParameter(
	ForgeTypeId parameterTypeId,
	LanguageType language
)
Visual Basic
Public Shared Function GetLabelForBuiltInParameter ( _
	parameterTypeId As ForgeTypeId, _
	language As LanguageType _
) As String
Visual C++
public:
static String^ GetLabelForBuiltInParameter(
	ForgeTypeId^ parameterTypeId,
	LanguageType language
)
Parameters
parameterTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the built-in parameter to get the user-visible name.
language
Type: Autodesk.Revit.ApplicationServices.LanguageType
 The desired LanguageType to get the user-visible name in.
Return Value
 The built-in parameter name in the desired LanguageType.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the built-in parameter cannot be found.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the desired LanguageType cannot be found for the built-in parameter name.
See Also
LabelUtils Class
GetLabelForBuiltInParameter Overload
Autodesk.Revit.DB Namespace